# 生存时间
通过EXPIRE命令或者PEXPIRE命令,客户端可以以秒或者毫秒精度为数据库中的某个键设置生成时间(Time To Live, TTL),在经过指定的秒数或者毫秒数之后,服务器就会自动删除生存时间为0的键:
```
redis> SET key value
OK 

redis> EXPIRE key 5
(integer) 1

redis> GET key // 5秒之内
"value"

redis> GET key // 5秒之后
(nil)
```
注意:
> SETEX命令可以在设置一个字符串键的同时为键设置过期时间,因为这个命令是一个类型限定的命令(只能用于字符串键),所以本章不会对这个命令进行介绍,但SETEX命令设置过期时间的原理和本章介绍的EXPIRE命令设置过期时间的原理是完全一样的.

# 过期时间
与EXPIRE命令和PEXPIRE命令类似,客户端可以通过EXPIREAT命令或PEXPIREAT命令,以秒或者毫秒精度给数据库中的某个键设置过期时间.

过期时间是一个UNIX时间戳,当键的过期时间来临时,服务器就会自动从数据库中删除这个键:
```
redis> SET key value
OK

redis> EXPIRE key 1377257300
(integer) 1

redis> TIME
"1377257296"
"296543"

redis> GET key  // 1377257300之前
"value"

redis> TIME
"1377257296"
"296543"

redis> GET key // 1377257300之后
(nil)
```

TTL命令和PTTL命令接受一个带有生存时间或者过期时间的键,返回这个键的剩余生存时间,也就是,返回距离这个键被服务器自动删除还有多长时间:
```
redis> SET key value
OK

redis> EXPIRE key 1000
(integer) 1

redis> TTL key
(integer) 997

redis> SET another_key another_value
OK

redis> TIME
"1377333070"
"761687"

redis> EXPIREAT another_key 1377333100
(integer) 1

redis> TTL another_key
(integer) 10
```

# 设置过期时间
Redis有四个不同的命令可以用于设置键的生存时间(键可以存在多久)或过期时间(键什么时候会被删除):
* `EXPIRE <key> <ttl>`命令用于将键key的生存时间设置为ttl秒.
* `PEXPIRE <key> <ttl>`命令用于将键key的生存时间设置为ttl毫秒.
* `EXPIREAT <key> <timestamp>`命令用于将键key的过期时间设置为timestamp所指定的秒数时间戳.
* `PEXPIREAT <key> <timestamp>`命令用于将键key的过期时间设置为timestamp所指定的毫秒数时间戳.

## 背后的实现原理
EXPIRE、PEXPIRE、EXPIREAT三个命令都是使用PEXPIREAT命令来实现的:无论客户端执行的是以上四个命令中的哪一个,经过转换之后,最终的执行效果都和执行PEXPIREAT命令一样.

首先,EXPIRE命令可以转换成PEXPIRE命令:
```python
def EXPIRE(key, ttl_in_sec):
    # 将TTL从秒转换成毫秒
    ttl_in_ms = sec_to_ms(ttl_in_sec)
    PEXPIRE(key, ttl_in_ms)
```
接着,PEXPIRE命令又可以转换成PEXPIREAT命令:
```python
def PEXPIRE(key, ttl_in_ms):
    # 获取以毫秒计算的当前UNIX时间戳
    now_ms = get_current_unix_timestamp_in_ms()

    # 当前时间加上TTL,得出毫秒格式的键过期时间
    PEXPIREAT(key, now_ms+ttl_in_ms)
```
并且,EXPIREAT命令也可以转换成PEXPIREAT命令:
```python
def EXPIREAT(key, expire_time_in_sec):
    # 将过期时间从秒转换成毫秒
    expire_time_in_ms = sec_to_ms(expire_time_in_sec)
    PEXPIREAT(key, expire_time_in_ms)
```
最终,EXPIRE、PEXPIRE和EXPIREAT三个命令都会转换成PEXPIREAT命令来执行,如下图(9-11)所示:

![设置生成时间和设置过期时间的命令之间的转换](https://github.com/gdufeZLYL/blog/blob/master/images/20180511210610.png)

# 保存过期时间
redisDb结构的expires字典保存了数据库中所有键的过期时间,我们称这个字典为过期字典:
* 过期字典的键是一个指针,这个指针指向键空间中的某个键对象(也即是某个数据库键).
* 过期字典的值是一个long long类型的整数,这个整数保存了键所指向的数据库键的过期时间——一个毫秒精度的UNIX时间戳.

```c++
typedef struct redisDb {
    // ...

    // 过期字典,保存着键的过期时间
    dict *expires;

    // ...
} redisDb;
```

例子:
图9-12展示了一个带有过期字典的数据库例子,在这个例子中,键空间保存了数据库中的所有键值对,而过期字典则保存了数据库键的过期时间.

![图9-12 带有过期字典的数据库例子](https://github.com/gdufeZLYL/blog/blob/master/images/20180511212652.png)

![图9-12 分析](https://github.com/gdufeZLYL/blog/blob/master/images/20180511212935.png)

如果数据库当前的状态如图9-12所示,执行以下命令之后:
```
redis> PEXPIREAT message 1391234400000
(integer) 1
```
结果:

![图9-13 执行PEXPIREAT命令之后的数据库](https://github.com/gdufeZLYL/blog/blob/master/images/20180511213327.png)

PEXPIREAT命令的伪代码定义:
```python
def PEXPIREAT(key, expire_time_in_ms):
    # 如果给定的键不存在与键空间,那么不能设置过期时间
    if key not in redisDb.dict:
        return 0
    
    # 在过期字典中关联键和过期时间
    redisDb.expires[keyu] = expire_time_in_ms

    # 过期时间设置成功
    return 1
```

# 移除过期时间
PERSIST命令可以移除一个键的过期时间:
```
redis> PEXPIREAT message 1391234400000
(integer) 1

redis> TTL message
(integer) 13893281

redis> PERSIST message
(integer) 1

redis> TTL message
(integer) -1
```
PERSIST命令就是PEXPIREAT命令的反操作:PERSIST命令在过期字典中查找给定的键,并解除键和值(过期时间)在过期字典中的关联.

例子:
如果数据库当前的状态如图9-12所示,那么当服务器执行以下命令之后：
```
redis> PERSIST book
(integer) 1
```
结果:当PERSIST命令执行之后,过期字典中原来的book键值对消失了,这代表数据库键book的过期时间已经被移除.

![图9-14 执行PERSIST之后的数据库](https://github.com/gdufeZLYL/blog/blob/master/images/20180511214622.png)

PERSIST命令的伪代码定义:
```python
def PERSIST(key):
    # 如果键不存在,或者键没有设置过期时间,那么直接返回
    if key not in redisDb.expires:
        return 0

    # 移除过期字典中给定键的键值对关联
    redisDb.expires.remove(key)

    # 键的过期时间移除成功
    return 1
```

# 计算并返回剩余生存时间
TTL命令以秒为单位返回键的剩余生存时间,而PTTL命令则以毫秒为单位返回键的剩余生存时间:
```
redis> PEXPIREAT alphabet 1385877600000
(integer) 1

redis> TTL alphabet
(integer) 8549007

redis> PTTL alphabet
(integer) 8549001011
```
TTL和PTTL两个命令都是通过计算键的过期时间和当前时间之间的差来实现的,以下是这两个命令的伪代码实现:
```python
def PTTL(key):
    # 键不存在于数据库
    if key not in redisDb.dict:
        return -2

    # 尝试取得键的过期时间
    # 如果键没有设置过期时间,那么expire_time_in_ms将为None
    expire_time_in_ms = redisDb.expires.get(key)

    # 键没有设置过期时间
    if expire_time_in_ms is None:
        return -1

    # 获得当前时间
    now_ms = get_current_unix_timestamp_in_ms()

    # 过期时间减去当前时间,得出的差就是键的剩余生存时间
    return(expire_time_in_ms - now_ms)

def TTL(key):
    # 获取以毫秒为单位的剩余生存时间
    ttl_in_ms = PTTL(key)

    if ttl_in_ms < 0:
        # 处理返回值为-2和-1的情况
        return ttl_in_ms
    else:
        # 将毫秒转换为秒
        return ms_to_sec(ttl_in_ms)
```

# 过期键的判定
通过过期字典,程序可以用以下步骤检查一个给定键是否过期:
1. 检查给定键是否存在于过期字典:如果存在,那么取得键的过期时间.
2. 检查当前UNIX时间戳是否大于键的过期时间:如果是的话,那么键已经过期;否则的话,键未过期.

伪代码如下:
```python
def is_expired(key):
    # 取得键的过期时间
    expire_time_in_ms = redisDb.expires.get(key)

    # 键没有设置过期时间
    if expire_time_in_ms is None:
        return False
    
    # 取得当前时间的UNIX时间戳
    now_ms = get_current_unix_timestamp_in_ms()

    # 检查当前时间是否大于键的过期时间
    if now_ms > expire_time_in_ms:
        # 是,键已经过期
        return True
    else:
        # 否,键未过期
        return False
```
注意:
> 实现过期键判定的另一种方法是使用TTL命令或者PTTL命令,比如说,如果对某个键执行TTL命令,并且命令返回的值大于等于0,那么说明该键未过期.在实际中,Redis检查键是否过期的方法和is_expired函数所描述的方法一致,因为直接访问字典比执行一个命令稍微快一些.